log3('= !=');



//=  赋值

var xx;
xx=11;
log3(`
//先取出xx的内存地址  1
//计算右边的表达式
//把表达式返回值写到内存地址 1

`)
var o={}
o.xx=222;
log3(`//先取出o.xx的内存地址  1
//计算右边的表达式
//把表达式返回值写到内存地址 1
`)
var arr=[];
arr[0]=1;
log3(`//先取出arr的第0个元素的内存地址  1
//计算右边的表达式
//把表达式返回值写到内存地址 1

//一个表达式内连续赋值`)


var a={v:1};
var b=a;
var c={c:2};
a.c=a=c;


log3(`
//先取出a.c的内存地址  1
                //先取出a的内存地址  2
                //把c写到内存地址 2      2   {c:2}
//把c写到内存地址1     1   {c:2}`)


log(a);
log(b);



log3(`

    1!=1<2=${1!=1<2}
    1!=true=${1!=true}

    1<1!=2=${1<1!=2}
    false!=2=${false!=2}

    1==1<2=${1==1<2}
    1==true=${1==true}

    
    1!==1<2=${1!==1<2}
    1!==true=${1!==true}
`);